In [11]:
import numpy as np
import pandas as pd

# Create Data Frame

In [12]:
data = {'Name': ['S1', 'S2', 'S3'],
        'Age': [25, 28, 22],
        'Score': np.array([95,80,75])}#
print(data)

{'Name': ['S1', 'S2', 'S3'], 'Age': [25, 28, 22], 'Score': array([95, 80, 75])}

In [13]:
# save to dataframe
df = pd.DataFrame(data)
print(df)

  Name  Age  Score
0   S1   25     95
1   S2   28     80
2   S3   22     75

In [14]:
# add row names
df = pd.DataFrame(data, index=['row1','row2','row3'])
print(df)

     Name  Age  Score
row1   S1   25     95
row2   S2   28     80
row3   S3   22     75

In [23]:
# list data
data2 =[['S1', 25, 95.],
        ['S2', 28, 80.],
        ['S3', 22, 75.]]
print(data2)

[['S1', 25, 95.0], ['S2', 28, 80.0], ['S3', 22, 75.0]]

In [24]:
# list to dataframe
df = pd.DataFrame(data2,
                  index=['row1', 'row2', 'row3'],
                  columns=['Name', 'Age', 'Score'])
df

     Name  Age  Score
row1   S1   25   95.0
row2   S2   28   80.0
row3   S3   22   75.0

# Subset Observation

In [25]:
# column observation
df['Name']

row1    S1
row2    S2
row3    S3
Name: Name, dtype: object

In [26]:
df['Age']

row1    25
row2    28
row3    22
Name: Age, dtype: int64

In [27]:
df['Score']

row1    95.0
row2    80.0
row3    75.0
Name: Score, dtype: float64

In [28]:
df[['Name', 'Score']]

     Name  Score
row1   S1   95.0
row2   S2   80.0
row3   S3   75.0

In [30]:
df.loc['row1']

Name       S1
Age        25
Score    95.0
Name: row1, dtype: object

In [31]:
df.loc[['row1', 'row3']]

     Name  Age  Score
row1   S1   25   95.0
row3   S3   22   75.0

In [33]:
# row and column observation
df.loc['row1', 'Name']

'S1'

In [34]:
df.loc[: , 'Name']

row1    S1
row2    S2
row3    S3
Name: Name, dtype: object

In [37]:
df.loc[:, 'Name':'Score']

     Name  Age  Score
row1   S1   25   95.0
row2   S2   28   80.0
row3   S3   22   75.0

In [39]:
# indexing/slicing
df.iloc[0,0]

'S1'

In [40]:
df.iloc[:, [0,2]]

     Name  Score
row1   S1   95.0
row2   S2   80.0
row3   S3   75.0

In [41]:
df.iloc[::2, [0, 2]]

     Name  Score
row1   S1   95.0
row3   S3   75.0

In [44]:
df.iloc[-1, :]

Name       S3
Age        22
Score    75.0
Name: row3, dtype: object

In [45]:
df.iloc[-1::, :]

     Name  Age  Score
row3   S3   22   75.0

In [46]:
df.iloc[-1::-1, :]

     Name  Age  Score
row3   S3   22   75.0
row2   S2   28   80.0
row1   S1   25   95.0

In [47]:
# head and tail
df.head(1)

     Name  Age  Score
row1   S1   25   95.0

In [48]:
df.head(2)

     Name  Age  Score
row1   S1   25   95.0
row2   S2   28   80.0

In [49]:
df.tail(1)

     Name  Age  Score
row3   S3   22   75.0

In [50]:
df.tail(2)

     Name  Age  Score
row2   S2   28   80.0
row3   S3   22   75.0